# Задача-1: Поработайте с переменными, создайте несколько, выведите на экран,
# запросите у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран.

a = input("Enter your name: ")
b_int = input("Enter your age: ")
c_float = input("Enter any number: ")

print(a, b_int, c_float)